{
   "sections":[
         {
            "title":"About Me",
            "scrollID":"about-me",
            "body":"My name is Harry Simpson! I am a 23 year old aspiring game developer from Sheffield, UK. My skills include Unity and C#, Unreal Engine 5 using blueprints, and Godot 4 using GDScript. That being said, I am keen to learn new languages, software and skills to expand my abilities. <p>My hobbies include playing video games and making test game development projects. While playing games, I often find myself wondering how the developers created some of the features and functions of their games and, in some cases, I create a test project in Unity to try and recreate these features. <p>Including my listed skills, I also have skills for basic graphic design, in particular UI, and music composition.<br>"
         },
         {
            "title":"My history with game development",
            "scrollID":"history",
            "body":"I first began developing games in January of 2015 in the Clickteam Fusion 2.5 software, which has been used in the past to create Five Nights at Freddy's, The Escapists and Baba Is You. While using Clickteam Fusion, I gained knowledge in game logic, maths and design by creating small but simple games that I could easily complete on my own. <p>Between 2015 and 2018, Clickteam Fusion 2.5 was the main software I stuck with. Then, in 2019, I began the transition to a new language since Clickteam provided no practice for any text-based programming languages nor capability for 3D games. Initially, I began learning GameMaker: Studio in order to begin to learn game development through code editing as opposed to Clickteam's event-based system. However, after a while, I wanted to learn to create 3D games so I transitioned to Unity and C#. <p>Since learning Unity, I have taken part in three game jams, two for University and one in my spare time, and I have had the opportunity to utilise and improve my skills by working as part of a team for a game development module at university <p>After the introduction of Unity's runtime fee in September 2023, I began learning new game engines to expand my horizons. I initially started with Unreal Engine 5, learning the basics of the blueprints system. However, I found Unreal Engine to be too bloated for my needs. In July 2024, I began learning Godot 4 and very quickly came to grips with the fundamentals of the engine, seeing it as a potential alternative to Unity for personal projects.<br>"
         },
         {
            "title":"Current Skills",
            "scrollID":"current-skills",
            "body":"My current skills include:<p>    • Unity & C#<p>    • Unreal Engine 5 (Blueprints Only)<p>    • Godot 4 & GDScript<br>"
         },
         {
            "title":"What are my goals?",
            "scrollID":"goals",
            "body":"In the future, I aim to take part in more game jams to expand my portfolio while also enjoying the challenge of creating games within a limited amount of time. Additionally, I aim to release some of my bigger projects such as VortexOS onto Steam to reach a wider audience. <p>Regarding expanding my knowledge, I aim to learn the C++ programming language since it is the most widely used language in the game development sphere and it is used commonly with Unreal Engine. While I may not use Unreal Engine for my personal projects, I know it would be worth learning C++ for my professional work.<br>"
         }
   ]
 }