{
    "title" : "Cellborn",
    "synopsis" : "Made for my university Game Development module, Cellborn sees you as the intrepid Elfin trying to escape the Evil Wizard's tower initially armed with nothing but a large collection of pebbles! Along the way, Elfin collects a wide variety of strange and interesting guns that can be used to defeat the fearsome fairies and spiteful spitting snakes that inhabit the tower!<p>Are you fearless enough to defeat the Evil Wizard and earn your freedom?",
    "team" : [{
        "role" : "Leads",
        "credits" : [ "Lead Director - Matilde Blackmore", "Lead Programmer - Luke Rapkin", "Lead Artist - Maisie Parkinson" ] },
    {
        "role" : "Programming",
        "credits" : [ "Matilde Blackmore", "Luke Rapkin", "Harry Simpson", "Thomas Walters" ] },
    {
        "role" : "Artists",
        "credits" : [ "Maisie Parkinson", "Harrison Reeves", "James Hendy", "Alex Norwood" ] },
    {
        "role" : "Audio",
        "credits" : [ "Harry Simpson" ]
    }],
    "skills" : [ "Game Settings", "UI, HUD, and UX", "Particle Systems", "Animation Events", "Unity Post Processing", "Teamwork" ],
    "experience" : "Cellborn was created as part of my Game Development module during my final year of university. This was a group project with groups consiting of students from the 'Computer Games Programming' course and the 'Computer Games Modelling and Animation' course. Our task was to create a strategy game, delivering development builds every week to present to our tutors. After some brainstorming, we decided to create a top-down fantasy shooter with a wide variety of weapons. This project was the one where I learned the most about developing a game in Unity. This was the project where I learned the most about good coding practices in C# and expanding upon existing code. <p>One of the features I was tasked with creating was the settings menu. It was a very simple settings menu yet developing this menu gave me a good understanding of both the post-processing stack in Unity's built-in render pipeline as well as of Unity's audio mixer which allowed me to create volume sliders. The framework of this settings menu is something that I have adopted to every game project that I have created, including The Patience Test. <p>Another responsibility I had was creating the particle effects for the game. These effects include enemy and player death particles, puffs of smoke, enemy attack effects, pick up effects, and potion effects. On top of this, I was also tasked with having these effects be played at the correct time by implementing Animation Events, which allowed me to instantiate the particle prefabs if and when I needed them. This gave me a good understanding of both Unity's particle system and the animation events system, which I can use to apply to my own projects in the future. <p>The most significant part of this whole project was, in my opinion, the teamwork. This project gave me a good understanding of working on a game in a team setting, working with others to create features and deliver a product within a timeframe. During the course of this project, there were disagreements over the implementation of different features and the quality of the code. In the end, however, these disputes and disagreements helped in not only improving the quality of my code but the quality of the final product."

}